import math


def area(r):
    """
    Вычисляет площадь круга по его радиусу.

    Параметры:
        r (int/float): Радиус круга.

    Возвращаемое значение:
        float: Площадь круга (pi * r^2)

    Пример вызова:
        area(5)
        Output: 78.53981633974483
    """
    return math.pi * r * r


def perimeter(r):
    """
    Вычисляет длину окружности (периметр) круга по его радиусу.

    Параметры:
        r (int/float): Радиус круга.

    Возвращаемое значение:
        float: Длина окружности (2 * pi * r)

    Пример вызова:
        perimeter(5)
        Output: 31.41592653589793
    """
    return 2 * math.pi * r