def area(a, b):
    """
    Вычисляет площадь прямоугольника по двум сторонам.

    Параметры:
        a (int/float): Длина первой стороны.
        b (int/float): Длина второй стороны.
    
    Возвращаемое значение:
        int/float: Площадь прямоугольника (a * b)

    Пример вызова:
        area(3, 5)
        Output: 15
    """
    return a * b

def perimeter(a, b):
    """
    Вычисляет параметр прямоугольника по двум сторонам.

    Параметры:
        a (int/float): Длина первой стороны.
        b (int/float): Длина второй стороны.

    Возвращаемое значение:
        int/float: Периметр прямоугольника (2 * (a + b))

    Пример вызова:
        perimeter(3, 5)
        Output: 16
    """
    return 2 * (a + b)