from math import pi

def area(r):
    """
    Вычисляет площадь поверхности сферы по ее радиусу.

    Параметры:
        r (int/float): Радиусс сферы.
    
    Возвращаемое значение:
        float: Площадь поверхности сферы (4 * pi * r^2)

    Пример вызова:
        area(4)
        Output: 201.06192982974676
    """
    return 4 * pi * r ** 2

def volume(r):
    """
    Вычисляет объем сферы по ее радиусу.

    Параметры:
        r (int/float): Радиус сферы.
    
    Возвращаемое значение:
        float: Объем сферы (4/3 * pi * r^3)

    Пример вызова:
        volume(4)
        Output: 268.082573106329

    """
    return (4 / 3) * pi * r ** 3