
def area(a):
    """
    Вычисляет площадь квадрата по длине его стороны.
    
    Параметры:
        a (int/float): Длина стороны квадрата.

    Возвращаемое значение:
        int/float: Площадь квадрата (a^2)

    Пример вызова:
        area(3)
        Output: 9
    """
    return a * a


def perimeter(a):
    """
    Вычисляет периметр квадрата по длине его стороны.

    Параметры:
        a (int/float): Длина стороны квадрата.

    Возвращаемое значение:
        int/float: Периметр квадрата (4 * a)
    
    Пример вызова:
        perimeter(3)
        Output: 12
    """
    return 4 * a