def area(a, h):
    """
    Вычисляет площадь треугольника по основанию и высоте.
    Если результат деления на 2 целочисленный, возвращает int, иначе float.

    Параметры:
        a (int/float): Длина основания треугольника.
        h (int/float): Высота, опущенная на основание a.
    
    Возвращаемое значение:
        int/float: Площадь треугольника (a * h / 2)

    Примеры вызова:
        area(4, 5)
        Output: 10

        area(3, 3)
        Output: 4.5
    """
    res =  a * h / 2
    return int(res) if res.is_integer() else res

def perimeter(a, b, c):
    """
    Вычисляет периметр треугольника по трем сторонам.

    Параметры:
        a (int/float): Длина первой стороны.
        b (int/float): Длина второй стороны.
        c (int/float): Длина третьей стороны.

    Возвращаемое значение:
        int/float: Периметр треугольника (a + b + c)

    Пример вызова:
        perimeter(3, 4, 5)
        Output: 12
    """
    return a + b + c